In [1]:
import pandas as pd

In [37]:
data={'crncy':['abc','xyz','abc','pqe','abc'],'name':['gyana','sura','mitu','gybali','gybighna'],'stock':[100,200,300,400,500],'trade':[10,20,30,40,50]

     
     }

In [38]:
df=pd.DataFrame(data)

df

  crncy      name  stock  trade
0   abc     gyana    100     10
1   xyz      sura    200     20
2   abc      mitu    300     30
3   pqe    gybali    400     40
4   abc  gybighna    500     50

In [17]:
df[(df['crncy']=='abc')&(df['name'].str.startswith('gy')) ]

  crncy      name  stock  trade
0   abc     gyana    100     10
4   abc  gybighna    500     50

In [18]:
df

  crncy      name  stock  trade
0   abc     gyana    100     10
1   xyz      sura    200     20
2   abc      mitu    300     30
3   pqe    gybali    400     40
4   abc  gybighna    500     50

In [39]:
def fun(crncy,name,stock):
    if crncy=='abc' and name.startswith('gy'):
        #print(crncy,name)
        stock=stock/10
    return stock 
        

df['stock']=df.apply(lambda x:fun(x['crncy'],x['name'],x['stock']),axis=1)

In [40]:
df

  crncy      name  stock  trade
0   abc     gyana   10.0     10
1   xyz      sura  200.0     20
2   abc      mitu  300.0     30
3   pqe    gybali  400.0     40
4   abc  gybighna   50.0     50

In [29]:
name='gyana'

.startswith('gy')

True

In [46]:
df['trade']=df.apply(lambda x:x['trade']/5 if x['crncy']=='pqe' else x['trade'],axis=1)

In [47]:
df

  crncy      name  stock  trade
0   abc     gyana   10.0   10.0
1   xyz      sura  200.0   20.0
2   abc      mitu  300.0   30.0
3   pqe    gybali  400.0    8.0
4   abc  gybighna   50.0   50.0

In [48]:
df.apply(lambda x:x['trade']/5 if x['crncy']=='xyz' else x['trade'],axis=1)

0    10.0
1     4.0
2    30.0
3     8.0
4    50.0
dtype: float64

In [49]:
df

  crncy      name  stock  trade
0   abc     gyana   10.0   10.0
1   xyz      sura  200.0   20.0
2   abc      mitu  300.0   30.0
3   pqe    gybali  400.0    8.0
4   abc  gybighna   50.0   50.0

In [52]:
df['trade']=df['trade'].astype(int)

In [53]:
df

  crncy      name  stock  trade
0   abc     gyana   10.0     10
1   xyz      sura  200.0     20
2   abc      mitu  300.0     30
3   pqe    gybali  400.0      8
4   abc  gybighna   50.0     50

In [54]:
df

  crncy      name  stock  trade
0   abc     gyana   10.0     10
1   xyz      sura  200.0     20
2   abc      mitu  300.0     30
3   pqe    gybali  400.0      8
4   abc  gybighna   50.0     50

In [69]:
df['stock'][(df['crncy']=='abc') & (df['name'].str.startswith('gy'))]=df[(df['crncy']=='abc') & (df['name'].str.startswith('gy'))]['stock']/5

/var/folders/zk/rl6r2z6d34z00g5q8tfywxt00000gn/T/ipykernel_1984/86417881.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['stock'][(df['crncy']=='abc') & (df['name'].str.startswith('gy'))]=df[(df['crncy']=='abc') & (df['name'].str.startswith('gy'))]['stock']/5

In [70]:
df

  crncy      name  stock  trade
0   abc     gyana    2.0     10
1   xyz      sura  200.0     20
2   abc      mitu  300.0     30
3   pqe    gybali  400.0      8
4   abc  gybighna   10.0     50